package xxx;

public class Homework2_2 {
	public static void main(String[] arg){
//	1. 請設計一隻Java程式，計算1～1000的偶數和 (2+4+6+8+…+1000)
		
//	2. 請設計一隻Java程式，計算1～10的連乘積 (1*2*3*…*10) (用for迴圈)
       
//	3. 請設計一隻Java程式，計算1～10的連乘積 (1*2*3*…*10) (用while迴圈)
	
//	4. 請設計一隻Java程式，輸出結果為以下：
//	1 4 9 16 25 36 49 64 81 100
	
//	5. 阿文很熱衷大樂透 (1 ～ 49)，但他不喜歡有4的數字，不論是個位數或是十位數。請設計一隻程式，
//	輸出結果為阿文可以選擇的數字有哪些？總共有幾個？
//	• 請設計一隻Java程式，輸出結果為以下：
//	1 2 3 4 5 6 7 8 9 10
//	1 2 3 4 5 6 7 8 9
//	1 2 3 4 5 6 7 8
//	1 2 3 4 5 6 7
//	1 2 3 4 5 6 
//	1 2 3 4 5
//	1 2 3 4 
//	1 2 3 
//	1 2 
//	1
	
//	6. 請設計一隻Java程式，輸出結果為以下：
//	A
//	BB
//	CCC
//	DDDD
//	EEEEE
//	FFFFFF
	}
}
